#### Terraform Plan (dev) 📖`success`

<details><summary>Show Plan</summary>

```terraform

data.aws_iam_policy_document.assume_eks_role: Reading...
data.aws_iam_policy_document.assume_eks-worker_role: Reading...
data.aws_vpc.conquer-vpc: Reading...
data.aws_iam_policy_document.assume_eks-worker_role: Read complete after 0s [id=2851119427]
data.aws_iam_policy_document.assume_eks_role: Read complete after 0s [id=3552664922]
data.aws_caller_identity.current: Reading...
data.aws_caller_identity.current: Read complete after 0s [id=014630368052]
data.aws_vpc.conquer-vpc: Read complete after 2s [id=vpc-080a377054fdb71a7]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.tls_certificate.eks will be read during apply
  # (config refers to values not yet known)
 <= data "tls_certificate" "eks" {
      + certificates = (known after apply)
      + id           = (known after apply)
      + url          = (known after apply)
    }

  # aws_eip.vpc_eip["eu-north-1a"] will be created
  + resource "aws_eip" "vpc_eip" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name" = "dev-conquer-eip-eu-north-1a"
        }
      + tags_all             = {
          + "Name"    = "dev-conquer-eip-eu-north-1a"
          + "owners"  = "the-devops-guys"
          + "project" = "dev-conquer"
        }
      + vpc                  = (known after apply)
    }

  # aws_eip.vpc_eip["eu-north-1b"] will be created
  + resource "aws_eip" "vpc_eip" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name" = "dev-conquer-eip-eu-north-1b"
        }
      + tags_all             = {
          + "Name"    = "dev-conquer-eip-eu-north-1b"
          + "owners"  = "the-devops-guys"
          + "project" = "dev-conquer"
        }
      + vpc                  = (known after apply)
    }

  # aws_eks_addon.aws-ebs-csi-driver will be created
  + resource "aws_eks_addon" "aws-ebs-csi-driver" {
      + addon_name                  = "aws-ebs-csi-driver"
      + addon_version               = (known after apply)
      + arn                         = (known after apply)
      + cluster_name                = "dev-conquer-cluster"
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + resolve_conflicts_on_update = "PRESERVE"
      + service_account_role_arn    = (known after apply)
      + tags_all                    = {
          + "owners"  = "the-devops-guys"
          + "project" = "dev-conquer"
        }
    }

  # aws_eks_addon.example will be created
  + resource "aws_eks_addon" "example" {
      + addon_name                  = "vpc-cni"
      + addon_version               = (known after apply)
      + arn                         = (known after apply)
      + cluster_name                = "dev-conquer-cluster"
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + resolve_conflicts_on_update = "PRESERVE"
      + tags_all                    = {
          + "owners"  = "the-devops-guys"
          + "project" = "dev-conquer"
        }
    }

  # aws_eks_cluster.eks will be created
  + resource "aws_eks_cluster" "eks" {
      + arn                       = (known after apply)
      + certificate_authority     = (known after apply)
      + cluster_id                = (known after apply)
      + created_at                = (known after apply)
      + enabled_cluster_log_types = [
          + "api",
          + "audit",
          + "authenticator",
          + "controllerManager",
          + "scheduler",
        ]
      + endpoint                  = (known after apply)
      + id                        = (known after apply)
      + identity                  = (known after apply)
      + name                      = "dev-conquer-cluster"
      + platform_version          = (known after apply)
      + role_arn                  = (known after apply)
      + status                    = (known after apply)
      + tags                      = {
          + "ctf" = "WW91IGdvdCBpdCEgbmljZS4="
        }
      + tags_all                  = {
          + "ctf"     = "WW91IGdvdCBpdCEgbmljZS4="
          + "owners"  = "the-devops-guys"
          + "project" = "dev-conquer"
        }
      + version                   = "1.28"

      + kubernetes_network_config {
          + ip_family         = "ipv4"
          + service_ipv4_cidr = "10.100.0.0/16"
          + service_ipv6_cidr = (known after apply)
        }

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = true
          + endpoint_public_access    = true
          + public_access_cidrs       = [
              + "0.0.0.0/0",
            ]
          + subnet_ids                = (known after apply)
          + vpc_id                    = (known after apply)
        }
    }

  # aws_eks_node_group.node-group["eu-north-1a"] will be created
  + resource "aws_eks_node_group" "node-group" {
      + ami_type               = (known after apply)
      + arn                    = (known after apply)
      + capacity_type          = "SPOT"
      + cluster_name           = "dev-conquer-cluster"
      + disk_size              = (known after apply)
      + id                     = (known after apply)
      + instance_types         = [
          + "t3.small",
        ]
      + node_group_name        = "dev-conquer-node-group-0"
      + node_group_name_prefix = (known after apply)
      + node_role_arn          = (known after apply)
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = (known after apply)
      + tags_all               = {
          + "owners"  = "the-devops-guys"
          + "project" = "dev-conquer"
        }
      + version                = (known after apply)

      + scaling_config {
          + desired_size = 2
          + max_size     = 2
          + min_size     = 1
        }

      + update_config {
          + max_unavailable = 1
        }
    }

  # aws_eks_node_group.node-group["eu-north-1b"] will be created
  + resource "aws_eks_node_group" "node-group" {
      + ami_type               = (known after apply)
      + arn                    = (known after apply)
      + capacity_type          = "SPOT"
      + cluster_name           = "dev-conquer-cluster"
      + disk_size              = (known after apply)
      + id                     = (known after apply)
      + instance_types         = [
          + "t3.small",
        ]
      + node_group_name        = "dev-conquer-node-group-1"
      + node_group_name_prefix = (known after apply)
      + node_role_arn          = (known after apply)
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = (known after apply)
      + tags_all               = {
          + "owners"  = "the-devops-guys"
          + "project" = "dev-conquer"
        }
      + version                = (known after apply)

      + scaling_config {
          + desired_size = 2
          + max_size     = 2
          + min_size     = 1
        }

      + update_config {
          + max_unavailable = 1
        }
    }

  # aws_iam_openid_connect_provider.eks-idp will be created
  + resource "aws_iam_openid_connect_provider" "eks-idp" {
      + arn             = (known after apply)
      + client_id_list  = [
          + "sts.amazonaws.com",
        ]
      + id              = (known after apply)
      + tags_all        = {
          + "owners"  = "the-devops-guys"
          + "project" = "dev-conquer"
        }
      + thumbprint_list = (known after apply)
      + url             = (known after apply)
    }

  # aws_iam_role.AmazonEKS_EBS_CSI_DriverRole will be created
  + resource "aws_iam_role" "AmazonEKS_EBS_CSI_DriverRole" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "AmazonEKS_EBS_CSI_DriverRole"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "owners"  = "the-devops-guys"
          + "project" = "dev-conquer"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role.eks_role will be created
  + resource "aws_iam_role" "eks_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "eks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "dev-conquer-eks-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "owners"  = "the-devops-guys"
          + "project" = "dev-conquer"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role.eks_worker_role will be created
  + resource "aws_iam_role" "eks_worker_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "dev-conquer-eks-worker-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "owners"  = "the-devops-guys"
          + "project" = "dev-conquer"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.AmazonEBSCSIDriverPolicy-attachment will be created
  + resource "aws_iam_role_policy_attachment" "AmazonEBSCSIDriverPolicy-attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonEBSCSIDriverPolicy"
      + role       = "AmazonEKS_EBS_CSI_DriverRole"
    }

  # aws_iam_role_policy_attachment.AmazonEC2ContainerRegistryReadOnly will be created
  + resource "aws_iam_role_policy_attachment" "AmazonEC2ContainerRegistryReadOnly" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
      + role       = "dev-conquer-eks-worker-role"
    }

  # aws_iam_role_policy_attachment.AmazonEC2RoleforSSM will be created
  + resource "aws_iam_role_policy_attachment" "AmazonEC2RoleforSSM" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonEC2RoleforSSM"
      + role       = "dev-conquer-eks-worker-role"
    }

  # aws_iam_role_policy_attachment.AmazonEKSClusterPolicy will be created
  + resource "aws_iam_role_policy_attachment" "AmazonEKSClusterPolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
      + role       = "dev-conquer-eks-role"
    }

  # aws_iam_role_policy_attachment.AmazonEKSWorkerNodePolicy will be created
  + resource "aws_iam_role_policy_attachment" "AmazonEKSWorkerNodePolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
      + role       = "dev-conquer-eks-worker-role"
    }

  # aws_iam_role_policy_attachment.AmazonEKS_CNI_Policy will be created
  + resource "aws_iam_role_policy_attachment" "AmazonEKS_CNI_Policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
      + role       = "dev-conquer-eks-worker-role"
    }

  # aws_nat_gateway.nat_gw["eu-north-1a"] will be created
  + resource "aws_nat_gateway" "nat_gw" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Name" = "dev-conquer-nat-gw-public-subnet-eu-north-1a"
        }
      + tags_all                           = {
          + "Name"    = "dev-conquer-nat-gw-public-subnet-eu-north-1a"
          + "owners"  = "the-devops-guys"
          + "project" = "dev-conquer"
        }
    }

  # aws_nat_gateway.nat_gw["eu-north-1b"] will be created
  + resource "aws_nat_gateway" "nat_gw" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Name" = "dev-conquer-nat-gw-public-subnet-eu-north-1b"
        }
      + tags_all                           = {
          + "Name"    = "dev-conquer-nat-gw-public-subnet-eu-north-1b"
          + "owners"  = "the-devops-guys"
          + "project" = "dev-conquer"
        }
    }

  # aws_route.nat_access["eu-north-1a"] will be created
  + resource "aws_route" "nat_access" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # aws_route.nat_access["eu-north-1b"] will be created
  + resource "aws_route" "nat_access" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # aws_route_table.private_subnet_rt["eu-north-1a"] will be created
  + resource "aws_route_table" "private_subnet_rt" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "dev-conquer-nat-eu-north-1a-rt"
        }
      + tags_all         = {
          + "Name"    = "dev-conquer-nat-eu-north-1a-rt"
          + "owners"  = "the-devops-guys"
          + "project" = "dev-conquer"
        }
      + vpc_id           = "vpc-080a377054fdb71a7"
    }

  # aws_route_table.private_subnet_rt["eu-north-1b"] will be created
  + resource "aws_route_table" "private_subnet_rt" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "dev-conquer-nat-eu-north-1b-rt"
        }
      + tags_all         = {
          + "Name"    = "dev-conquer-nat-eu-north-1b-rt"
          + "owners"  = "the-devops-guys"
          + "project" = "dev-conquer"
        }
      + vpc_id           = "vpc-080a377054fdb71a7"
    }

  # aws_route_table_association.private_subnet_rt_association["eu-north-1a"] will be created
  + resource "aws_route_table_association" "private_subnet_rt_association" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.private_subnet_rt_association["eu-north-1b"] will be created
  + resource "aws_route_table_association" "private_subnet_rt_association" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_subnet.eks_subnets_private["eu-north-1a"] will be created
  + resource "aws_subnet" "eks_subnets_private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-north-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "dev-conquer-private_subnet_eu-north-1a"
          + "Tier" = "Private"
        }
      + tags_all                                       = {
          + "Name"    = "dev-conquer-private_subnet_eu-north-1a"
          + "Tier"    = "Private"
          + "owners"  = "the-devops-guys"
          + "project" = "dev-conquer"
        }
      + vpc_id                                         = "vpc-080a377054fdb71a7"
    }

  # aws_subnet.eks_subnets_private["eu-north-1b"] will be created
  + resource "aws_subnet" "eks_subnets_private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-north-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "dev-conquer-private_subnet_eu-north-1b"
          + "Tier" = "Private"
        }
      + tags_all                                       = {
          + "Name"    = "dev-conquer-private_subnet_eu-north-1b"
          + "Tier"    = "Private"
          + "owners"  = "the-devops-guys"
          + "project" = "dev-conquer"
        }
      + vpc_id                                         = "vpc-080a377054fdb71a7"
    }

  # aws_subnet.eks_subnets_public["eu-north-1a"] will be created
  + resource "aws_subnet" "eks_subnets_public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-north-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.3.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "dev-conquer-public_subnet_eu-north-1a"
          + "Tier" = "Public"
        }
      + tags_all                                       = {
          + "Name"    = "dev-conquer-public_subnet_eu-north-1a"
          + "Tier"    = "Public"
          + "owners"  = "the-devops-guys"
          + "project" = "dev-conquer"
        }
      + vpc_id                                         = "vpc-080a377054fdb71a7"
    }

  # aws_subnet.eks_subnets_public["eu-north-1b"] will be created
  + resource "aws_subnet" "eks_subnets_public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-north-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.4.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "dev-conquer-public_subnet_eu-north-1b"
          + "Tier" = "Public"
        }
      + tags_all                                       = {
          + "Name"    = "dev-conquer-public_subnet_eu-north-1b"
          + "Tier"    = "Public"
          + "owners"  = "the-devops-guys"
          + "project" = "dev-conquer"
        }
      + vpc_id                                         = "vpc-080a377054fdb71a7"
    }

Plan: 29 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + endpoint                              = (known after apply)
  + kubeconfig-certificate-authority-data = (sensitive value)
  + oidc-issuer                           = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.out"

```

</details>

*Pusher: @carlosgit2016, Action: `pull_request`, Working Directory: ``, Workflow: `create-ephemeral-resources`*